let regExp = new RegExp(str, flag) //! 1 варіант через конструктор

let regExp2 = /g/flag //! 2 варіант через літерал /g/i - незалежний регістер


- i //* незалежний регістер
- g //* глобальний пошук - шукати всі
- s //* . === \n    режим сумісності для символу крапка і переносу на іншу стрічку

regExp.test(str) //! bool - знайдено щось чи ні true або false

str.match(regExp) //! повертаються дані в вигляді масив або null - [] | null

- \d - 0-9 //* шукаємо будь яку цифру
- \w - a-z 0-9 _ //* все це входить в нього
- \s - " " //* Це пробіл 

- \D //* все крім цифр
- \W //* те що не входить в \w
- \S //* все що не входить в \s

- . (\n) //* підходить під будь що крім переноса на іншу стрічку

'asudj \n aoisdj' /\s.\s/s //* /s під крапку підходить і перенос строки 
'12$ \n hi'.match(/$./s)

'12.23'.match(/\./) //* тепер просто важаеться за свичайну крапку
'12.23'.replace(/\d/g,'0') //! першим параметром що шукаємо а другим на те що заміняємо